In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [18]:
open = pd.read_csv('email_opened_table.csv')
email = pd.read_csv('email_table.csv')
click = pd.read_csv('link_clicked_table.csv')

In [19]:
open

       email_id
0        284534
1        609056
2        220820
3        905936
4        164034
...         ...
10340    990213
10341    918210
10342    200299
10343    211104
10344    320631

[10345 rows x 1 columns]

In [20]:
open['opened'] = 1
open

       email_id  opened
0        284534       1
1        609056       1
2        220820       1
3        905936       1
4        164034       1
...         ...     ...
10340    990213       1
10341    918210       1
10342    200299       1
10343    211104       1
10344    320631       1

[10345 rows x 2 columns]

In [21]:
click

      email_id
0       609056
1       870980
2       935124
3       158501
4       177561
...        ...
2114    873162
2115    435454
2116    206772
2117    742967
2118    916564

[2119 rows x 1 columns]

In [23]:
click['clicked'] = 1
click

      email_id  clicked
0       609056        1
1       870980        1
2       935124        1
3       158501        1
4       177561        1
...        ...      ...
2114    873162        1
2115    435454        1
2116    206772        1
2117    742967        1
2118    916564        1

[2119 rows x 2 columns]

In [30]:
df = pd.merge(open, click, on='email_id', how='outer')

In [34]:
new_df = pd.merge(df, email, on='email_id', how='outer')
new_df

,email_id,opened,clicked,email_text,email_version,hour,weekday,user_country,user_past_purchases
0,8,NaN,NaN,short_email,generic,9,Thursday,US,3
1,33,NaN,NaN,long_email,personalized,6,Monday,US,0
2,46,NaN,NaN,short_email,generic,14,Tuesday,US,3
3,49,1.0,NaN,long_email,personalized,11,Thursday,US,10
4,65,NaN,NaN,short_email,generic,8,Wednesday,UK,3
...,...,...,...,...,...,...,...,...,...
99995,999969,NaN,NaN,short_email,generic,21,Thursday,US,0
99996,999972,NaN,NaN,long_email,personalized,6,Tuesday,US,5
99997,999976,NaN,NaN,long_email,personalized,5,Wednesday,UK,0
99998,999980,NaN,NaN,long_email,generic,10,Thursday,FR,4
99999,999998,NaN,NaN,long_email,generic,16,Friday,FR,0